#
# Brewfile
#
### About Brewfile (from: https://github.com/joelparkerhenderson/brewfile/blob/main/Brewfile)
# * http://brew.sh/
# * http://homebrew-file.readthedocs.io/
# * http://github.com/Homebrew/homebrew-bundle
#
#################################################
#
# Tap Homebrew
#
#################################################

tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

#################################################
#
# Homebrew
#
#################################################

brew "bat"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "exa"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "guile"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "luajit", args: ["HEAD"]
brew "mkcert"
brew "neovim", args: ["HEAD"]
brew "nghttp2"
brew "nss"
brew "perl"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "stow"
brew "tmux"
brew "tree"
brew "vim"
brew "z"

#################################################
#
# Applications
#
#################################################

cask "alfred"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "kap"
cask "kitty"
cask "runjs"

#################################################
#
# Fonts
#
#################################################

cask "font-jetbrains-mono"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"

