#
# Brewfile
#
### About Brewfile (from: https://github.com/joelparkerhenderson/brewfile/blob/main/Brewfile)
# * http://brew.sh/
# * http://homebrew-file.readthedocs.io/
# * http://github.com/Homebrew/homebrew-bundle
#
#################################################
#
# Tap Homebrew
#
#################################################

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

#################################################
#
# Homebrew
#
#################################################

brew 'bat'
brew 'coreutils'
brew 'efm-langserver'
brew 'exa'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'lua'
brew 'luajit'
brew 'luajit-openresty'
brew 'luarocks'
brew 'neovim'
brew 'ripgrep'
brew 'stow'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'tree-sitter'
brew 'vim'
brew 'z'

#################################################
#
# Applications
#
#################################################

cask 'alfred'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'kap'
cask 'kitty'
cask 'runjs'

#################################################
#
# Fonts
#
#################################################
cask 'font-jetbrains-mono'
cask 'font-hack-nerd-font'
cask 'font-fira-code-nerd-font'
